analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/ctb_regs.h
/**@} end of group CTB_CRC_VAL_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_CRC_PRNG CTB_CRC_PRNG
 * @brief    Pseudo-Random Number Generator. Output of the Galois Field shift register. This
 *           holds the resulting pseudo-random number if entropy is disabled or true random
 *           number if entropy is enabled.
 * @{
 */
#define MXC_F_CTB_CRC_PRNG_PRNG_POS                    0 /**< CRC_PRNG_PRNG Position */
#define MXC_F_CTB_CRC_PRNG_PRNG                        ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_CRC_PRNG_PRNG_POS)) /**< CRC_PRNG_PRNG Mask */

/**@} end of group CTB_CRC_PRNG_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_HAM_ECC CTB_HAM_ECC
 * @brief    Hamming ECC Register.
 * @{
 */
#define MXC_F_CTB_HAM_ECC_ECC_POS                      0 /**< HAM_ECC_ECC Position */
#define MXC_F_CTB_HAM_ECC_ECC                          ((uint32_t)(0xFFFFUL << MXC_F_CTB_HAM_ECC_ECC_POS)) /**< HAM_ECC_ECC Mask */

#define MXC_F_CTB_HAM_ECC_PAR_POS                      16 /**< HAM_ECC_PAR Position */
#define MXC_F_CTB_HAM_ECC_PAR                          ((uint32_t)(0x1UL << MXC_F_CTB_HAM_ECC_PAR_POS)) /**< HAM_ECC_PAR Mask */

/**@} end of group CTB_HAM_ECC_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_CIPHER_INIT CTB_CIPHER_INIT
 * @brief    Initial Vector. For block cipher operations that use CBC, CFB, OFB, or CNTR
 *           modes, this register holds the initial value. This register is updated with each
 *           encryption or decryption operation. This register is affected by the endian swap
 *           bits.
 * @{
 */
#define MXC_F_CTB_CIPHER_INIT_IVEC_POS                 0 /**< CIPHER_INIT_IVEC Position */
#define MXC_F_CTB_CIPHER_INIT_IVEC                     ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_CIPHER_INIT_IVEC_POS)) /**< CIPHER_INIT_IVEC Mask */

/**@} end of group CTB_CIPHER_INIT_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_CIPHER_KEY CTB_CIPHER_KEY
 * @brief    Cipher Key.  This register holds the key used for block cipher operations. The
 *           lower words are used for block ciphers that use shorter key lengths. This
 *           register is affected by the endian swap input control bits.
 * @{
 */
#define MXC_F_CTB_CIPHER_KEY_KEY_POS                   0 /**< CIPHER_KEY_KEY Position */
#define MXC_F_CTB_CIPHER_KEY_KEY                       ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_CIPHER_KEY_KEY_POS)) /**< CIPHER_KEY_KEY Mask */

/**@} end of group CTB_CIPHER_KEY_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_HASH_DIGEST CTB_HASH_DIGEST
 * @brief    This register holds the calculated hash value. This register is affected by the
 *           endian swap bits.
 * @{
 */
#define MXC_F_CTB_HASH_DIGEST_HASH_POS                 0 /**< HASH_DIGEST_HASH Position */
#define MXC_F_CTB_HASH_DIGEST_HASH                     ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_HASH_DIGEST_HASH_POS)) /**< HASH_DIGEST_HASH Mask */

/**@} end of group CTB_HASH_DIGEST_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_HASH_MSG_SZ CTB_HASH_MSG_SZ
 * @brief    Message Size. This register holds the lowest 32-bit of message size in bytes.
 * @{
 */
#define MXC_F_CTB_HASH_MSG_SZ_MSGSZ_POS                0 /**< HASH_MSG_SZ_MSGSZ Position */
#define MXC_F_CTB_HASH_MSG_SZ_MSGSZ                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_HASH_MSG_SZ_MSGSZ_POS)) /**< HASH_MSG_SZ_MSGSZ Mask */

/**@} end of group CTB_HASH_MSG_SZ_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_A_LENGTH_0 CTB_A_LENGTH_0
 * @brief    .AAD Length Register 0.
 * @{
 */
#define MXC_F_CTB_A_LENGTH_0_A_LENGTH_POS              0 /**< A_LENGTH_0_A_LENGTH Position */
#define MXC_F_CTB_A_LENGTH_0_A_LENGTH                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_A_LENGTH_0_A_LENGTH_POS)) /**< A_LENGTH_0_A_LENGTH Mask */

/**@} end of group CTB_A_LENGTH_0_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_A_LENGTH_1 CTB_A_LENGTH_1
 * @brief    .AAD Length Register 1.
 * @{
 */
#define MXC_F_CTB_A_LENGTH_1_A_LENGTH_POS              0 /**< A_LENGTH_1_A_LENGTH Position */
#define MXC_F_CTB_A_LENGTH_1_A_LENGTH                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_A_LENGTH_1_A_LENGTH_POS)) /**< A_LENGTH_1_A_LENGTH Mask */

/**@} end of group CTB_A_LENGTH_1_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_PLD_LENGTH_0 CTB_PLD_LENGTH_0
 * @brief    .PLD Length Register 0.
 * @{
 */
#define MXC_F_CTB_PLD_LENGTH_0_PLD_LENGTH_POS          0 /**< PLD_LENGTH_0_PLD_LENGTH Position */
#define MXC_F_CTB_PLD_LENGTH_0_PLD_LENGTH              ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_PLD_LENGTH_0_PLD_LENGTH_POS)) /**< PLD_LENGTH_0_PLD_LENGTH Mask */

/**@} end of group CTB_PLD_LENGTH_0_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_PLD_LENGTH_1 CTB_PLD_LENGTH_1
 * @brief    .LENGTH.
 * @{
 */
#define MXC_F_CTB_PLD_LENGTH_1_PLD_LENGTH_POS          0 /**< PLD_LENGTH_1_PLD_LENGTH Position */
#define MXC_F_CTB_PLD_LENGTH_1_PLD_LENGTH              ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_PLD_LENGTH_1_PLD_LENGTH_POS)) /**< PLD_LENGTH_1_PLD_LENGTH Mask */

/**@} end of group CTB_PLD_LENGTH_1_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_TAGMIC CTB_TAGMIC
 * @brief    TAG/MIC Registers.
 * @{
 */
#define MXC_F_CTB_TAGMIC_TAGMIC_POS                    0 /**< TAGMIC_TAGMIC Position */
#define MXC_F_CTB_TAGMIC_TAGMIC                        ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_TAGMIC_TAGMIC_POS)) /**< TAGMIC_TAGMIC Mask */

/**@} end of group CTB_TAGMIC_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_CN CTB_SCA_CN
 * @brief    SCA Control 0 Register.
 * @{
 */
#define MXC_F_CTB_SCA_CN_STC_POS                       0 /**< SCA_CN_STC Position */
#define MXC_F_CTB_SCA_CN_STC                           ((uint32_t)(0x1UL << MXC_F_CTB_SCA_CN_STC_POS)) /**< SCA_CN_STC Mask */

#define MXC_F_CTB_SCA_CN_SCAIE_POS                     1 /**< SCA_CN_SCAIE Position */
#define MXC_F_CTB_SCA_CN_SCAIE                         ((uint32_t)(0x1UL << MXC_F_CTB_SCA_CN_SCAIE_POS)) /**< SCA_CN_SCAIE Mask */

#define MXC_F_CTB_SCA_CN_ABORT_POS                     2 /**< SCA_CN_ABORT Position */
#define MXC_F_CTB_SCA_CN_ABORT                         ((uint32_t)(0x1UL << MXC_F_CTB_SCA_CN_ABORT_POS)) /**< SCA_CN_ABORT Mask */

#define MXC_F_CTB_SCA_CN_ERMEM_POS                     4 /**< SCA_CN_ERMEM Position */
#define MXC_F_CTB_SCA_CN_ERMEM                         ((uint32_t)(0x1UL << MXC_F_CTB_SCA_CN_ERMEM_POS)) /**< SCA_CN_ERMEM Mask */

