analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/ctb_regs.h
#define MXC_F_CTB_SCA_CN_MANPARAM_POS                  5 /**< SCA_CN_MANPARAM Position */
#define MXC_F_CTB_SCA_CN_MANPARAM                      ((uint32_t)(0x1UL << MXC_F_CTB_SCA_CN_MANPARAM_POS)) /**< SCA_CN_MANPARAM Mask */

#define MXC_F_CTB_SCA_CN_HWKEY_POS                     6 /**< SCA_CN_HWKEY Position */
#define MXC_F_CTB_SCA_CN_HWKEY                         ((uint32_t)(0x1UL << MXC_F_CTB_SCA_CN_HWKEY_POS)) /**< SCA_CN_HWKEY Mask */

#define MXC_F_CTB_SCA_CN_OPCODE_POS                    8 /**< SCA_CN_OPCODE Position */
#define MXC_F_CTB_SCA_CN_OPCODE                        ((uint32_t)(0x1FUL << MXC_F_CTB_SCA_CN_OPCODE_POS)) /**< SCA_CN_OPCODE Mask */

#define MXC_F_CTB_SCA_CN_MODADDR_POS                   16 /**< SCA_CN_MODADDR Position */
#define MXC_F_CTB_SCA_CN_MODADDR                       ((uint32_t)(0x1FUL << MXC_F_CTB_SCA_CN_MODADDR_POS)) /**< SCA_CN_MODADDR Mask */

#define MXC_F_CTB_SCA_CN_ECCSIZE_POS                   24 /**< SCA_CN_ECCSIZE Position */
#define MXC_F_CTB_SCA_CN_ECCSIZE                       ((uint32_t)(0x3UL << MXC_F_CTB_SCA_CN_ECCSIZE_POS)) /**< SCA_CN_ECCSIZE Mask */

/**@} end of group CTB_SCA_CN_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_ACN CTB_SCA_ACN
 * @brief    SCA Advanced Control Register.
 * @{
 */
#define MXC_F_CTB_SCA_ACN_MAN_POS                      0 /**< SCA_ACN_MAN Position */
#define MXC_F_CTB_SCA_ACN_MAN                          ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ACN_MAN_POS)) /**< SCA_ACN_MAN Mask */

#define MXC_F_CTB_SCA_ACN_AUTOCARRY_POS                1 /**< SCA_ACN_AUTOCARRY Position */
#define MXC_F_CTB_SCA_ACN_AUTOCARRY                    ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ACN_AUTOCARRY_POS)) /**< SCA_ACN_AUTOCARRY Mask */

#define MXC_F_CTB_SCA_ACN_PLUSONE_POS                  2 /**< SCA_ACN_PLUSONE Position */
#define MXC_F_CTB_SCA_ACN_PLUSONE                      ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ACN_PLUSONE_POS)) /**< SCA_ACN_PLUSONE Mask */

#define MXC_F_CTB_SCA_ACN_RESSELECT_POS                3 /**< SCA_ACN_RESSELECT Position */
#define MXC_F_CTB_SCA_ACN_RESSELECT                    ((uint32_t)(0x3UL << MXC_F_CTB_SCA_ACN_RESSELECT_POS)) /**< SCA_ACN_RESSELECT Mask */

#define MXC_F_CTB_SCA_ACN_CARRYPOS_POS                 8 /**< SCA_ACN_CARRYPOS Position */
#define MXC_F_CTB_SCA_ACN_CARRYPOS                     ((uint32_t)(0x3FFUL << MXC_F_CTB_SCA_ACN_CARRYPOS_POS)) /**< SCA_ACN_CARRYPOS Mask */

/**@} end of group CTB_SCA_ACN_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_ST CTB_SCA_ST
 * @brief    SCA Status Register.
 * @{
 */
#define MXC_F_CTB_SCA_ST_BUSY_POS                      0 /**< SCA_ST_BUSY Position */
#define MXC_F_CTB_SCA_ST_BUSY                          ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_BUSY_POS)) /**< SCA_ST_BUSY Mask */

#define MXC_F_CTB_SCA_ST_SCAIF_POS                     1 /**< SCA_ST_SCAIF Position */
#define MXC_F_CTB_SCA_ST_SCAIF                         ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_SCAIF_POS)) /**< SCA_ST_SCAIF Mask */

#define MXC_F_CTB_SCA_ST_PVF1_POS                      2 /**< SCA_ST_PVF1 Position */
#define MXC_F_CTB_SCA_ST_PVF1                          ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_PVF1_POS)) /**< SCA_ST_PVF1 Mask */

#define MXC_F_CTB_SCA_ST_PVF2_POS                      3 /**< SCA_ST_PVF2 Position */
#define MXC_F_CTB_SCA_ST_PVF2                          ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_PVF2_POS)) /**< SCA_ST_PVF2 Mask */

#define MXC_F_CTB_SCA_ST_FSMERR_POS                    4 /**< SCA_ST_FSMERR Position */
#define MXC_F_CTB_SCA_ST_FSMERR                        ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_FSMERR_POS)) /**< SCA_ST_FSMERR Mask */

#define MXC_F_CTB_SCA_ST_COMPERR_POS                   5 /**< SCA_ST_COMPERR Position */
#define MXC_F_CTB_SCA_ST_COMPERR                       ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_COMPERR_POS)) /**< SCA_ST_COMPERR Mask */

#define MXC_F_CTB_SCA_ST_MEMERR_POS                    6 /**< SCA_ST_MEMERR Position */
#define MXC_F_CTB_SCA_ST_MEMERR                        ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_MEMERR_POS)) /**< SCA_ST_MEMERR Mask */

#define MXC_F_CTB_SCA_ST_CARRY_POS                     8 /**< SCA_ST_CARRY Position */
#define MXC_F_CTB_SCA_ST_CARRY                         ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_CARRY_POS)) /**< SCA_ST_CARRY Mask */

#define MXC_F_CTB_SCA_ST_GTE2I2_POS                    9 /**< SCA_ST_GTE2I2 Position */
#define MXC_F_CTB_SCA_ST_GTE2I2                        ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_GTE2I2_POS)) /**< SCA_ST_GTE2I2 Mask */

#define MXC_F_CTB_SCA_ST_ALUNEG1_POS                   10 /**< SCA_ST_ALUNEG1 Position */
#define MXC_F_CTB_SCA_ST_ALUNEG1                       ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_ALUNEG1_POS)) /**< SCA_ST_ALUNEG1 Mask */

#define MXC_F_CTB_SCA_ST_ALUNEG2_POS                   11 /**< SCA_ST_ALUNEG2 Position */
#define MXC_F_CTB_SCA_ST_ALUNEG2                       ((uint32_t)(0x1UL << MXC_F_CTB_SCA_ST_ALUNEG2_POS)) /**< SCA_ST_ALUNEG2 Mask */

/**@} end of group CTB_SCA_ST_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_PPX_ADDR CTB_SCA_PPX_ADDR
 * @brief    PPX Coordinate Data Pointer Register.
 * @{
 */
#define MXC_F_CTB_SCA_PPX_ADDR_PPX_ADDR_POS            0 /**< SCA_PPX_ADDR_PPX_ADDR Position */
#define MXC_F_CTB_SCA_PPX_ADDR_PPX_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_PPX_ADDR_PPX_ADDR_POS)) /**< SCA_PPX_ADDR_PPX_ADDR Mask */

/**@} end of group CTB_SCA_PPX_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_PPY_ADDR CTB_SCA_PPY_ADDR
 * @brief    PPY Coordinate Data Pointer Register.
 * @{
 */
#define MXC_F_CTB_SCA_PPY_ADDR_PPY_ADDR_POS            0 /**< SCA_PPY_ADDR_PPY_ADDR Position */
#define MXC_F_CTB_SCA_PPY_ADDR_PPY_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_PPY_ADDR_PPY_ADDR_POS)) /**< SCA_PPY_ADDR_PPY_ADDR Mask */

/**@} end of group CTB_SCA_PPY_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_PPZ_ADDR CTB_SCA_PPZ_ADDR
 * @brief    PPZ Coordinate Data Pointer Register.
 * @{
 */
#define MXC_F_CTB_SCA_PPZ_ADDR_PPZ_ADDR_POS            0 /**< SCA_PPZ_ADDR_PPZ_ADDR Position */
#define MXC_F_CTB_SCA_PPZ_ADDR_PPZ_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_PPZ_ADDR_PPZ_ADDR_POS)) /**< SCA_PPZ_ADDR_PPZ_ADDR Mask */

/**@} end of group CTB_SCA_PPZ_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_PQX_ADDR CTB_SCA_PQX_ADDR
 * @brief    PQX Coordinate Data Pointer Register.
 * @{
 */
#define MXC_F_CTB_SCA_PQX_ADDR_PQX_ADDR_POS            0 /**< SCA_PQX_ADDR_PQX_ADDR Position */
#define MXC_F_CTB_SCA_PQX_ADDR_PQX_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_PQX_ADDR_PQX_ADDR_POS)) /**< SCA_PQX_ADDR_PQX_ADDR Mask */

/**@} end of group CTB_SCA_PQX_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_PQY_ADDR CTB_SCA_PQY_ADDR
 * @brief    PQY Coordinate Data Pointer Register.
 * @{
 */
#define MXC_F_CTB_SCA_PQY_ADDR_PQY_ADDR_POS            0 /**< SCA_PQY_ADDR_PQY_ADDR Position */
#define MXC_F_CTB_SCA_PQY_ADDR_PQY_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_PQY_ADDR_PQY_ADDR_POS)) /**< SCA_PQY_ADDR_PQY_ADDR Mask */

/**@} end of group CTB_SCA_PQY_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_PQZ_ADDR CTB_SCA_PQZ_ADDR
 * @brief    PQZ Coordinate Data Pointer Register.
 * @{
 */
#define MXC_F_CTB_SCA_PQZ_ADDR_PQZ_ADDR_POS            0 /**< SCA_PQZ_ADDR_PQZ_ADDR Position */
#define MXC_F_CTB_SCA_PQZ_ADDR_PQZ_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_PQZ_ADDR_PQZ_ADDR_POS)) /**< SCA_PQZ_ADDR_PQZ_ADDR Mask */

/**@} end of group CTB_SCA_PQZ_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_RDSA_ADDR CTB_SCA_RDSA_ADDR
 * @brief    SCA RDSA Address Register.
 * @{
 */
#define MXC_F_CTB_SCA_RDSA_ADDR_RDSA_ADDR_POS          0 /**< SCA_RDSA_ADDR_RDSA_ADDR Position */
#define MXC_F_CTB_SCA_RDSA_ADDR_RDSA_ADDR              ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_RDSA_ADDR_RDSA_ADDR_POS)) /**< SCA_RDSA_ADDR_RDSA_ADDR Mask */

/**@} end of group CTB_SCA_RDSA_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_RES_ADDR CTB_SCA_RES_ADDR
 * @brief    SCA Result Address Register.
 * @{
 */
#define MXC_F_CTB_SCA_RES_ADDR_RES_ADDR_POS            0 /**< SCA_RES_ADDR_RES_ADDR Position */
#define MXC_F_CTB_SCA_RES_ADDR_RES_ADDR                ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_RES_ADDR_RES_ADDR_POS)) /**< SCA_RES_ADDR_RES_ADDR Mask */

/**@} end of group CTB_SCA_RES_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_OP_BUFF_ADDR CTB_SCA_OP_BUFF_ADDR
 * @brief    SCA Operation Buffer Address Register.
 * @{
 */
#define MXC_F_CTB_SCA_OP_BUFF_ADDR_OPBUFF_ADDR_POS     0 /**< SCA_OP_BUFF_ADDR_OPBUFF_ADDR Position */
#define MXC_F_CTB_SCA_OP_BUFF_ADDR_OPBUFF_ADDR         ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_OP_BUFF_ADDR_OPBUFF_ADDR_POS)) /**< SCA_OP_BUFF_ADDR_OPBUFF_ADDR Mask */

/**@} end of group CTB_SCA_OP_BUFF_ADDR_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_SCA_MODDATA CTB_SCA_MODDATA
 * @brief    SCA Modulo Data Input Register.
 * @{
 */
#define MXC_F_CTB_SCA_MODDATA_MODDATA_POS              0 /**< SCA_MODDATA_MODDATA Position */
#define MXC_F_CTB_SCA_MODDATA_MODDATA                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_CTB_SCA_MODDATA_MODDATA_POS)) /**< SCA_MODDATA_MODDATA Mask */

/**@} end of group CTB_SCA_MODDATA_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32520_INCLUDE_CTB_REGS_H_
